{
  "project": "Audio Slice Tool",
  "branchName": "ralph/marker-control-label-refinement",
  "description": "Marker control label refinement - Show keyboard label by default for enabled sections, close icon on hover, always show close for disabled sections",
  "userStories": [
    {
      "id": "US-001",
      "title": "Show keyboard label as default for enabled sections",
      "description": "As a user, I want to see the keyboard mapping number (1-9) as the default control above enabled section markers.",
      "acceptanceCriteria": [
        "Enabled sections show numeric keyboard label (1-9) above the left marker",
        "Close (×) icon is NOT visible by default for enabled sections",
        "Label is clearly readable and centered above the marker line",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Show close icon on hover for enabled sections",
      "description": "As a user, I want the close icon to appear when I hover over the keyboard label, so I can delete the marker.",
      "acceptanceCriteria": [
        "Hovering over the keyboard label area reveals the close (×) icon",
        "The keyboard label is hidden when close icon is shown (only one visible at a time)",
        "Transition uses quick fade (100-150ms opacity transition)",
        "When hover ends, close icon fades out and keyboard label fades back in",
        "Close icon changes to red/danger color (e.g. text-red-500) on hover",
        "Clicking close icon deletes the marker",
        "Clicking keyboard label does NOT trigger deletion",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Always show close icon for disabled sections",
      "description": "As a user, I want disabled sections to always show the close icon so I can distinguish them from enabled sections.",
      "acceptanceCriteria": [
        "Disabled sections show close (×) icon by default (not keyboard label)",
        "No keyboard mapping number is ever shown for disabled sections",
        "Close icon remains visible on hover (no swap behavior for disabled)",
        "Close icon still changes to red/danger color on hover",
        "Cursor changes to not-allowed when hovering disabled marker control area",
        "Clicking close icon still deletes the marker",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Ensure stable hover interactions",
      "description": "As a user, I want hover transitions to be stable without flickering.",
      "acceptanceCriteria": [
        "No flickering when transitioning between label and close icon",
        "Hover area is the entire control container (not just the icon/label element)",
        "Hover state maintained while mouse is within control area",
        "Control does not interfere with marker drag behavior on waveform below",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 4,
      "passes": false,
      "notes": ""
    }
  ]
}
