{
  "project": "Audio Slice Tool",
  "branchName": "ralph/context-aware-toolbar-v2",
  "description": "Context-Aware Toolbar v2 - Center-aligned editing controls above waveform, no background, visible only when markers exist",
  "userStories": [
    {
      "id": "US-001",
      "title": "Create EditorToolbar component with center alignment",
      "description": "As a developer, I need a dedicated toolbar component that renders editing controls in a centered horizontal row above the waveform.",
      "acceptanceCriteria": [
        "Create new file src/components/EditorToolbar.tsx",
        "Component accepts props: canUndo, canRedo, onUndo, onRedo, onReset, onExportAll, hasMarkers, hasSections, disabled",
        "Renders UndoRedoButtons and ExportAllButton in a single horizontal row",
        "Controls centered using flex justify-center items-center",
        "Controls ordered left to right: Undo, Redo, Reset, then Export All",
        "Export All only visible when hasSections is true",
        "Component has fixed height h-10 (40px) to reserve vertical space",
        "No background color - use bg-transparent or omit background",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Implement context-aware toolbar visibility",
      "description": "As a user, I want editing controls to only appear when I have markers, so the UI feels minimal when idle.",
      "acceptanceCriteria": [
        "EditorToolbar shows empty reserved space (h-10) when hasMarkers is false",
        "Undo/Redo/Reset buttons appear instantly when hasMarkers becomes true",
        "Export All appears when hasSections is true",
        "Controls disappear instantly after reset clears all markers",
        "No fade animation - instant show/hide",
        "Toolbar container (h-10) always renders to prevent layout shifts",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Integrate toolbar above waveform in App layout",
      "description": "As a user, I want the editing toolbar positioned directly above the waveform.",
      "acceptanceCriteria": [
        "Remove UndoRedoButtons from header section in App.tsx",
        "Remove ExportAllButton from header section in App.tsx",
        "Add EditorToolbar between header and MarkerControlStrip inside waveform container",
        "Header retains only FileLoaderButton and loading indicator",
        "Pass all required props to EditorToolbar: canUndo, canRedo, onUndo, onRedo, onReset, onExportAll, hasMarkers, hasSections, disabled",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Verify no duplicate controls and clean layout",
      "description": "As a developer, I need to ensure no duplicate controls exist.",
      "acceptanceCriteria": [
        "Only one instance of UndoRedoButtons exists (inside EditorToolbar)",
        "Only one instance of ExportAllButton exists (inside EditorToolbar)",
        "Remove any unused imports from App.tsx",
        "Layout has no visual glitches or misalignments",
        "Typecheck passes",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 4,
      "passes": false,
      "notes": ""
    }
  ]
}
